#!/usr/bin/env python

allPttrn={'countyPat': '.[^市區]縣',
 'cityPat': '[^是在於及、，]{1,2}市',
 'districtPat': '那瑪夏區|[^市及、，]?.社?區',
 'roadPat': '(?<=[縣市區鄉鎮里村])[^市區鄉鎮村路及、，]{1,}([路街]|大道)',
 'sectionPat': '\\s?[\\d零一二三四五六七八九十百千１２３４５６７８９０]*?\\s?段',
 'townshipPat': '(阿里山|三地門|太麻里)鄉|..[鄉里]',
 'townPat': '..鎮',
 'villagePat': '..村',
 'neighborhoodPat': '(\\s?[\\d零一二三四五六七八九十百千１２３４５６７８９０]*?\\s?鄰)',
 'alleyPat': '(國中|([^縣市區鄉鎮里村路段]{1,2}|鐵路)[\\d零一二三四五六七八九十百千１２３４５６７８９０]*?|\\s?[\\d零一二三四五六七八九十百千１２３４５６７８９０]*?)\\s?巷([\\d零一二三四五六七八九十百千１２３４５６７８９０]*?\\s?弄)?',
 'numberPat': '(\\s?[\\d零一二三四五六七八九十百千１２３４５６７８９０]*?\\s?[之\\-]\\s?)?\\s?[\\d零一二三四五六七八九十百千１２３４５６７８９０]*?\\s?號([之\\-]\\s?[\\d零一二三四五六七八九十百千１２３４５６７８９０]+?)?',
 'floorPat': '\\s?[\\d零一二三四五六七八九十百千１２３４５６７８９０]*?\\s?[fF樓]\\s?([之\\-]\\s?[\\d零一二三四五六七八九十百千１２３４５６７８９０]*?)?',
 'roomPat': '\\s?[a-zA-Z]*?\\d*?([a-zA-Z]*?)?(\\d*?)?\\s?室',
}
for k, v in allPttrn.items(): 
    mtch=compile(v).search(addr) 
    if mtch:print(mtch.group(0)) 
